; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob4321) (:domain Depot)
(:objects
	depot0 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate9)
	(at pallet3 distributor1)
	(clear crate7)
	(at pallet4 distributor0)
	(clear crate0)
	(at pallet5 distributor0)
	(clear crate8)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet4)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(at crate2 depot0)
	(on crate2 pallet0)
	(at crate3 distributor0)
	(on crate3 pallet5)
	(at crate4 distributor1)
	(on crate4 pallet3)
	(at crate5 distributor0)
	(on crate5 crate1)
	(at crate6 distributor0)
	(on crate6 crate5)
	(at crate7 distributor1)
	(on crate7 crate4)
	(at crate8 distributor0)
	(on crate8 crate3)
	(at crate9 distributor1)
	(on crate9 pallet2)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 crate0)
		(on crate3 crate8)
		(on crate6 pallet2)
		(on crate7 pallet1)
		(on crate8 pallet4)
		(on crate9 pallet0)
	)
)(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate0 pallet4 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet4)
   added: (lifting hoist1 crate0) (clear pallet4)
   goals met: 0 of 7
2. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 0 of 7
3. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 7
4. (lift hoist2 crate7 crate4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 crate4)
   added: (lifting hoist2 crate7) (clear crate4)
   goals met: 0 of 7
5. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   goals met: 0 of 7
6. (lift hoist2 crate9 pallet2 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 pallet2)
   added: (lifting hoist2 crate9) (clear pallet2)
   goals met: 0 of 7
7. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   goals met: 0 of 7
8. (lift hoist2 crate4 pallet3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 pallet3)
   added: (lifting hoist2 crate4) (clear pallet3)
   goals met: 0 of 7
9. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 0 of 7
10. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   goals met: 0 of 7
11. (drop hoist2 crate0 pallet3 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet3)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 pallet3)
   goals met: 1 of 7
12. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   goals met: 1 of 7
13. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 1 of 7
14. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   goals met: 1 of 7
15. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   goals met: 1 of 7
16. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 7
17. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 1 of 7
18. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 1 of 7
19. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 1 of 7
20. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 2 of 7
21. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   goals met: 2 of 7
22. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 7
23. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 2 of 7
24. (unload hoist0 crate9 truck0 depot0)
   deleted: (in crate9 truck0) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 2 of 7
25. (drop hoist0 crate9 pallet0 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet0)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet0)
   goals met: 3 of 7
26. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 7
27. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   goals met: 3 of 7
28. (drop hoist2 crate1 crate0 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate0)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate0)
   goals met: 4 of 7
29. (lift hoist1 crate8 crate3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate3)
   added: (lifting hoist1 crate8) (clear crate3)
   goals met: 4 of 7
30. (drop hoist1 crate8 pallet4 distributor0)
   deleted: (lifting hoist1 crate8) (clear pallet4)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 pallet4)
   goals met: 5 of 7
31. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 5 of 7
32. (drop hoist2 crate6 pallet2 distributor1)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 pallet2)
   goals met: 6 of 7
33. (lift hoist1 crate3 pallet5 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet5)
   added: (lifting hoist1 crate3) (clear pallet5)
   goals met: 6 of 7
34. (drop hoist1 crate3 crate8 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate8)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate8)
   goals met: 7 of 7
